// © Copyright 2012-2013, 2015-2016 HP Development Company, L.P.

// Task name & description
HSDTaskName = "프록시 서버 설정";
HSDTaskDescription = "프린터가 인터넷 연결을 지원합니다. 프록시 서버를 사용하여 인터넷에 연결하는 경우 아래 설정을 구성하십시오.";
TaskDescriptionInAssistantMode = "HP 웹 서비스에 연결하려면 프린터를 인터넷에 연결해야 합니다. 프록시 서버를 사용하여 인터넷에 연결하는 경우 아래에 설정을 입력하십시오.\n\n프록시 설정을 모르는 경우 네트워크 환경설정 패널의 설정을 참조하거나 시스템 관리자에게 문의하십시오.";

// Radio buttons matrix
HSDProxyServerNotRequiredTitle = "프록시 서버를 인터넷에 연결하지 않아도 됩니다";
HSDAutomaticProxySettingsTitle = "자동(장치가 자동으로 설정을 감지함)";
HSDCustomProxySettingsTitle = "사용자 정의 프록시 서버 구성:";
HSDSystemProxySettingsTitle = "시스템 설정 복사";

// Proxy server settings
HSDProxyServerTitle = "프록시 서버:";
ProxyPortTitle = "프록시 포트:";

// Authentication
HSDRequiresAuthenticationButton = "프록시 서버를 사용하려면 인증이 필요합니다";
HSDUserNameTitle = "사용자 이름:";
HSDPasswordTitle = "암호:";

HSDApplyNowButtonTitle = "지금 적용";

// progress titles
UpdateInformationProcessTitle = "정보를 업데이트하는 중...";

// alerts
EmptyProxyServerOrPortErrorText = "프록시 서버와 프록시 포트를 모두 지정해야 합니다.";

EmptyUserNameOrPasswordErrorText = "프록시 서버를 인증하려면 사용자 이름과 암호를 모두 지정해야 합니다.";

IncorrectProxyServerNameFormatErrorText = "프록시 서버 이름을 설정하지 못했습니다. 형식이 올바른지 확인하십시오.";

HSDUserNameTooLargeErrorText = "사용자 이름이 너무 큽니다. 사용자 이름은 문자 %d개까지 허용합니다.";
